caption = "Бесконечная спираль"
fps = f"Кадры в секунду: "

instructions = [
    "---Навигация---",
    "пробел:                           Добавляет новый квадрат.",
    "левая кнопка мыши:       Перетаскивает средний квадрат.",
    "колёсико мыши:              Изменяет изменяемую переменную.",
    "прокрутить вверх:           Увеличивает выбранную переменную.",
    "прокрутить вниз:            Уменьшает выбранную переменную.",
    "правая кнопка мыши:     Удаляет последний добавленный квадрат.",
    "OK"
    ]

variables = [
    "Скорость: ",
    " градус/кадр",
    "Размер: ",
    " px^2",
    "Радиус: ",
    " px",
    "Красный: ",
    " цвет",
    "Зелёный: ",
    " цвет",
    "Синий: ",
    " цвет",
    "Ничего"
]

developer = [
    "Автор: Siminmin",
    "",
    "Музыка: C418 - Stall",
    "",
    "Ссылка на github:",
    "    https://github.com/Siminmindav/spinner",
    "",
    "Перевели: Saceszka и Spell",
    "Спасибо за игру!",
    "",
]